Merge branch 'master' into feat/logs-ui-improvements
